#+title: Organisation
#+COLUMNS: %50ITEM(Task) %7TODO %14CLOCKSUM(Clock)

* Organisation
** DONE [#A] Call - Friday [2/2]
:LOGBOOK:
CLOCK: [2024-01-12 Fri 15:03]--[2024-01-12 Fri 15:16] =>  0:13
CLOCK: [2024-01-12 Fri 13:15]--[2024-01-12 Fri 14:47] =>  1:32
:END:
- [X] call with Anna and Viktor
  - [X] update about the last week
  - [X] suggest Prototyping for Incentives Protocoll
  - [X] scratch out Opti
    - [X] Show Software Design Workflow
  - [X] reiterate Ideas
  - [X] Come up with Demi
- [X] Add some notes to HackMD
  - [X] readjust Opti.md
  - [X] readjust Demi.md (ported)
  - [X] call it a day

** DONE [#B] Bare Setup - Saturday
:LOGBOOK:
CLOCK: [2024-01-13 Sat 14:10]--[2024-01-13 Sat 14:59] =>  0:49
CLOCK: [2024-01-13 Sat 13:48]--[2024-01-13 Sat 14:10] =>  0:22
CLOCK: [2024-01-13 Sat 12:56]--[2024-01-13 Sat 13:36] =>  0:40
CLOCK: [2024-01-13 Sat 12:15]--[2024-01-13 Sat 12:43] =>  0:28
CLOCK: [2024-01-13 Sat 11:15]--[2024-01-13 Sat 12:01] =>  0:46
CLOCK: [2024-01-13 Sat 10:03]--[2024-01-13 Sat 10:54] =>  0:51
:END:
- [X] do Github Setup
- [X] setup Organisation.org File
  - [X] send message in TG of how it works
- [X] readjust Demi.md
  - [X] rewrite Demi.md
- [X] skratch out a Figma [8/8]
  - [X] create a Frame
  - [X] add colors
  - [X] add Type Combi
  - [X] clean up
  - [X] create Input Field Component
  - [X] create Button Component
  - [X] generate a better logo(ported)
    - [X] go for a die-cut sticker
    - [X] download font
    - [X] create outline
      - [X] export
      - [X] importe, generate componetnt
    - [X] generate one
  - [X] add Figma to Github

** DONE [#B] Design - Sunday
:LOGBOOK:
CLOCK: [2024-01-14 Sun 10:05]--[2024-01-14 Sun 10:22] =>  0:17
CLOCK: [2024-01-14 Sun 08:32]--[2024-01-14 Sun 09:54] =>  1:22
:END:
- [X] generate a better logo(ported)
  - [X] go for a die-cut sticker
  - [X] download font
  - [X] create outline
    - [X] export
    - [X] importe, generate componetnt
  - [X] generate one
- [X] setup up export format
- [X] add Cover
- [X] add Intro
- [X] refine Logo - Inspiration
- [X] create Landing Page, which current Design System
- [X] clean up
- [X] export, add to Github

** TODO [#B] Code - Landing Page
:LOGBOOK:
CLOCK: [2024-01-15 Mon 00:53]--[2024-01-15 Mon 00:58] =>  0:05
CLOCK: [2024-01-15 Mon 00:37]--[2024-01-15 Mon 00:52] =>  0:15
CLOCK: [2024-01-14 Sun 23:54]--[2024-01-15 Mon 00:32] =>  0:38
CLOCK: [2024-01-14 Sun 23:35]--[2024-01-14 Sun 23:51] =>  0:16
CLOCK: [2024-01-14 Sun 22:18]--[2024-01-14 Sun 23:14] =>  0:56
CLOCK: [2024-01-14 Sun 21:41]--[2024-01-14 Sun 21:48] =>  0:07
CLOCK: [2024-01-14 Sun 21:24]--[2024-01-14 Sun 21:41] =>  0:17
CLOCK: [2024-01-14 Sun 20:16]--[2024-01-14 Sun 20:51] =>  0:35
CLOCK: [2024-01-14 Sun 15:27]--[2024-01-14 Sun 15:31] =>  0:04
CLOCK: [2024-01-14 Sun 14:08]--[2024-01-14 Sun 15:22] =>  1:14
CLOCK: [2024-01-14 Sun 12:03]--[2024-01-14 Sun 12:29] =>  0:26
CLOCK: [2024-01-14 Sun 11:17]--[2024-01-14 Sun 11:59] =>  0:42
CLOCK: [2024-01-14 Sun 10:24]--[2024-01-14 Sun 11:10] =>  0:46
:END:

- [X] add inkathon! to current project somehow
- [X] make package.json somehow work for docs
- [X] make package.json somehow work for frontend
- [X] make package.json somehow work for contracts
- [X] make scripts work in root folder
- [X] make everythin work from root
- [X] commit that mess ina reasonable order ^^
- [X] add current state of Organisation.org
- [X] call with Botond, ask about Validation AI Setup
- [X] write quick notes, add to docs/notes
- [X] rearange docs package, add notes, change logo
- [X] code input field
  - [X] get rid of boilerplate
  - [X] add input css in global.css
  - [X] update aichat to gpt4
  - [X] add state via css
- [X] code button
- [X] align button and input field
- [X] code logo
- [X] code landing page
- [X] build
- [X] commit progress
- [ ] deploy draft (postpone, seems timeconsuming)
